export const COLORS = ['#7C4DFF', '#00E5FF', '#00E676', '#FFAB40', '#FF5252', '#F48FB1'];

export const ROLE_LABELS = { 
  0: '步兵', 
  1: '弓箭手', 
  2: '骑兵', 
  3: '长枪兵', 
  4: '法师', 
  5: '辅助' 
};

export const ROLE_SYMBOLS = { 
  0: '🛡️', 
  1: '🏹', 
  2: '🏇', 
  3: '🔱', 
  4: '🔮', 
  5: '➕' 
};

export const ROLE_ID_RANGES = { 
  0: 10000, 
  1: 20000, 
  2: 30000, 
  3: 40000, 
  4: 50000, 
  5: 60000, 
  Boss: 90000 
};

export const BOSS_PREFIXES = ['【极秘项目】', '【变异主宰】', '【钢铁暴君】', '【末日先兆】', '【零号病毒】', '【虚空母体】'];

export const ROLE_NAME_POOLS = {
  0: ['盾卫', '禁卫军', '重装步兵', '先锋突击手', '圣殿骑士', '十字军', '斯巴达勇士', '坚盾守卫', '铁甲卫士', '破虏禁卫'],
  1: ['神射手', '游侠', '长弓手', '风行者', '影行者', '狙击手', '暗夜弩手', '飞羽卫', '落日神弓', '猎鹰射手'],
  2: ['轻骑兵', '重装骑兵', '骠骑兵', '龙骑士', '独角兽骑士', '狼骑兵', '圣光骑士', '游骑兵', '铁骑军', '风驰骑兵'],
  3: ['长枪卫士', '拒马枪兵', '铁血枪魂', '青龙偃月', '破阵枪兵', '龙胆枪手', '锋锐枪卫', '突刺者', '精锐长枪', '红缨枪卫'],
  4: ['元素使', '秘法导师', '大魔导师', '寒冰巫师', '烈焰术士', '雷霆领主', '幻术师', '唤星者', '暗影主宰', '炼金术师'],
  5: ['神圣牧师', '贤者', '织命者', '德鲁伊', '潮汐使者', '战地医师', '吟游诗人', '祈愿者', '圣光使徒', '守护灵医']
};

export const ROLE_COMMON_SKILLS = {
  0: 10120, // 步兵 -> 盾击
  1: 30010, // 弓箭手 -> 射击
  2: 10010, // 骑兵 -> 冲杀
  3: 10010, // 长枪兵 -> 突刺
  4: 30010, // 法师 -> 法术
  5: 30010  // 辅助 -> 治疗弹
};
